In [125]:
import pandas as pd

In [126]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [127]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [128]:
y = df.Survived
X = df.drop('Survived',axis='columns')

In [129]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [130]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [131]:
dummies = pd.get_dummies(X.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [132]:
X = pd.concat([X,dummies],axis='columns')
X.head()

   Pclass     Sex   Age     Fare  female   male
0       3    male  22.0   7.2500   False   True
1       1  female  38.0  71.2833    True  False
2       3  female  26.0   7.9250    True  False
3       1  female  35.0  53.1000    True  False
4       3    male  35.0   8.0500   False   True

In [133]:
X.drop(['Sex', 'male'],axis='columns',inplace=True)
X.sample(5)

     Pclass   Age     Fare  female
739       3   NaN   7.8958   False
437       2  24.0  18.7500    True
171       3   4.0  29.1250   False
32        3   NaN   7.7500    True
821       3  27.0   8.6625   False

In [134]:
X.Age = X.Age.fillna(X.Age.mean())
X.sample(5)

     Pclass   Age    Fare  female
442       3  25.0   7.775   False
655       2  24.0  73.500   False
861       2  21.0  11.500   False
216       3  27.0   7.925    True
480       3   9.0  46.900   False

In [135]:
from sklearn.model_selection import train_test_split

In [136]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [146]:
from sklearn.tree import DecisionTreeClassifier
tree = DecisionTreeClassifier()

In [147]:
tree.fit(X_train, y_train)

DecisionTreeClassifier()

In [148]:
from sklearn.metrics import accuracy_score

In [149]:
y_pred = tree.predict(X_test)
y_pred

array([1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0,
       1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 1, 0], dtype=int64)

In [150]:
accuracy = accuracy_score(y_test, y_pred)
accuracy

0.770949720670391

In [151]:
def updated_decision_tree(age, fare):
    if age >= 60 or fare < 20:
        return 0  # "Not Survived ones"
    else:
        return 1  # "Survived ones"

In [152]:
y_pred_modified = [updated_decision_tree(age, fare) for age, fare in zip(X_test["Age"], X_test["Fare"])]

In [153]:
new_accuracy = accuracy_score(y_test, y_pred_modified)
new_accuracy

0.664804469273743